Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, None, None,  0                                            
__________________________________________________________________________________________________
conv3d (Conv3D)                 (None, None, None, N 7040        input_1[0][0]                    
__________________________________________________________________________________________________
batch_normalization (BatchNorma (None, None, None, N 512         conv3d[0][0]                     
__________________________________________________________________________________________________
activation (Activation)         (None, None, None, N 0           batch_normalization[0][0]        
__________________________________________________________________________________________________
conv3d_1 (Conv3D)               (None, None, None, N 884992      activation[0][0]                 
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, None, None, N 1024        conv3d_1[0][0]                   
__________________________________________________________________________________________________
activation_1 (Activation)       (None, None, None, N 0           batch_normalization_1[0][0]      
__________________________________________________________________________________________________
average_pooling3d (AveragePooli (None, None, None, N 0           activation_1[0][0]               
__________________________________________________________________________________________________
conv3d_2 (Conv3D)               (None, None, None, N 590080      average_pooling3d[0][0]          
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, None, None, N 1024        conv3d_2[0][0]                   
__________________________________________________________________________________________________
activation_2 (Activation)       (None, None, None, N 0           batch_normalization_2[0][0]      
__________________________________________________________________________________________________
conv3d_3 (Conv3D)               (None, None, None, N 1180160     activation_2[0][0]               
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, None, None, N 2048        conv3d_3[0][0]                   
__________________________________________________________________________________________________
activation_3 (Activation)       (None, None, None, N 0           batch_normalization_3[0][0]      
__________________________________________________________________________________________________
average_pooling3d_1 (AveragePoo (None, None, None, N 0           activation_3[0][0]               
__________________________________________________________________________________________________
conv3d_4 (Conv3D)               (None, None, None, N 262656      average_pooling3d_1[0][0]        
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, None, None, N 2048        conv3d_4[0][0]                   
__________________________________________________________________________________________________
activation_4 (Activation)       (None, None, None, N 0           batch_normalization_4[0][0]      
__________________________________________________________________________________________________
conv3d_5 (Conv3D)               (None, None, None, N 525312      activation_4[0][0]               
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (None, None, None, N 4096        conv3d_5[0][0]                   
__________________________________________________________________________________________________
activation_5 (Activation)       (None, None, None, N 0           batch_normalization_5[0][0]      
__________________________________________________________________________________________________
average_pooling3d_2 (AveragePoo (None, None, None, N 0           activation_5[0][0]               
__________________________________________________________________________________________________
conv3d_6 (Conv3D)               (None, None, None, N 1049600     average_pooling3d_2[0][0]        
__________________________________________________________________________________________________
batch_normalization_6 (BatchNor (None, None, None, N 4096        conv3d_6[0][0]                   
__________________________________________________________________________________________________
activation_6 (Activation)       (None, None, None, N 0           batch_normalization_6[0][0]      
__________________________________________________________________________________________________
conv3d_7 (Conv3D)               (None, None, None, N 2099200     activation_6[0][0]               
__________________________________________________________________________________________________
batch_normalization_7 (BatchNor (None, None, None, N 8192        conv3d_7[0][0]                   
__________________________________________________________________________________________________
activation_7 (Activation)       (None, None, None, N 0           batch_normalization_7[0][0]      
__________________________________________________________________________________________________
conv3d_transpose (Conv3DTranspo (None, None, None, N 113248256   activation_7[0][0]               
__________________________________________________________________________________________________
cropping3d (Cropping3D)         (None, None, None, N 0           conv3d_transpose[0][0]           
__________________________________________________________________________________________________
cropping3d_1 (Cropping3D)       (None, None, None, N 0           activation_5[0][0]               
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, None, None, N 0           cropping3d[0][0]                 
                                                                 cropping3d_1[0][0]               
__________________________________________________________________________________________________
conv3d_8 (Conv3D)               (None, None, None, N 3146752     concatenate[0][0]                
__________________________________________________________________________________________________
batch_normalization_8 (BatchNor (None, None, None, N 4096        conv3d_8[0][0]                   
__________________________________________________________________________________________________
activation_8 (Activation)       (None, None, None, N 0           batch_normalization_8[0][0]      
__________________________________________________________________________________________________
conv3d_9 (Conv3D)               (None, None, None, N 1049600     activation_8[0][0]               
__________________________________________________________________________________________________
batch_normalization_9 (BatchNor (None, None, None, N 4096        conv3d_9[0][0]                   
__________________________________________________________________________________________________
activation_9 (Activation)       (None, None, None, N 0           batch_normalization_9[0][0]      
__________________________________________________________________________________________________
conv3d_transpose_1 (Conv3DTrans (None, None, None, N 28312576    activation_9[0][0]               
__________________________________________________________________________________________________
cropping3d_2 (Cropping3D)       (None, None, None, N 0           conv3d_transpose_1[0][0]         
__________________________________________________________________________________________________
cropping3d_3 (Cropping3D)       (None, None, None, N 0           activation_3[0][0]               
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, None, None, N 0           cropping3d_2[0][0]               
                                                                 cropping3d_3[0][0]               
__________________________________________________________________________________________________
conv3d_10 (Conv3D)              (None, None, None, N 7078400     concatenate_1[0][0]              
__________________________________________________________________________________________________
batch_normalization_10 (BatchNo (None, None, None, N 2048        conv3d_10[0][0]                  
__________________________________________________________________________________________________
activation_10 (Activation)      (None, None, None, N 0           batch_normalization_10[0][0]     
__________________________________________________________________________________________________
conv3d_11 (Conv3D)              (None, None, None, N 2359808     activation_10[0][0]              
__________________________________________________________________________________________________
batch_normalization_11 (BatchNo (None, None, None, N 2048        conv3d_11[0][0]                  
__________________________________________________________________________________________________
activation_11 (Activation)      (None, None, None, N 0           batch_normalization_11[0][0]     
__________________________________________________________________________________________________
conv3d_transpose_2 (Conv3DTrans (None, None, None, N 7078400     activation_11[0][0]              
__________________________________________________________________________________________________
cropping3d_4 (Cropping3D)       (None, None, None, N 0           conv3d_transpose_2[0][0]         
__________________________________________________________________________________________________
cropping3d_5 (Cropping3D)       (None, None, None, N 0           activation_1[0][0]               
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, None, None, N 0           cropping3d_4[0][0]               
                                                                 cropping3d_5[0][0]               
__________________________________________________________________________________________________
conv3d_12 (Conv3D)              (None, None, None, N 1769728     concatenate_2[0][0]              
__________________________________________________________________________________________________
batch_normalization_12 (BatchNo (None, None, None, N 1024        conv3d_12[0][0]                  
__________________________________________________________________________________________________
activation_12 (Activation)      (None, None, None, N 0           batch_normalization_12[0][0]     
__________________________________________________________________________________________________
conv3d_13 (Conv3D)              (None, None, None, N 590080      activation_12[0][0]              
__________________________________________________________________________________________________
batch_normalization_13 (BatchNo (None, None, None, N 1024        conv3d_13[0][0]                  
__________________________________________________________________________________________________
activation_13 (Activation)      (None, None, None, N 0           batch_normalization_13[0][0]     
__________________________________________________________________________________________________
conv3d_14 (Conv3D)              (None, None, None, N 514         activation_13[0][0]              
__________________________________________________________________________________________________
activation_14 (Activation)      (None, None, None, N 0           conv3d_14[0][0]                  
==================================================================================================
Total params: 171,270,530
Trainable params: 22,612,610
Non-trainable params: 148,657,920
__________________________________________________________________________________________________
